app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('hello!!', 'KAZ76_nemof01_TP_V.jpg', 2, 1, '2019-01-23 11:11:38', '2019-01-23 11:11:38')
---
json.image    @message.image.url
json.date     @message.created_at.strftime("%Y/%m/%d %H:%M")