app/views/messages/index.html.haml

<<<<<<< HEAD
        = current_user.groups.name
      .left-header__members
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1