app/views/messages/index.html.haml

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2
---
        .member
          - @group.users.each do |user|