app/controllers/groups_controller.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2019-01-11 13:00:46', '2019-01-11 13:00:46')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('グループ名', '2019-01-11 13:00:46', '2019-01-11 13:00:46')
---
  def create
    @group = Group.new(group_params)
    @group.users << current_user

UPDATE `groups` SET `name` = 'グループ名2', `updated_at` = '2019-01-23 05:35:52' WHERE `groups`.`id` = 1
---
  def update
    if @group.update(group_params)